tap "fluxcd/tap"
tap "slp/krunkit"
brew "curlie"
brew "fish"
brew "gemini-cli"
brew "gh"
brew "jq"
brew "kubecm"
brew "kubeconform"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "midnight-commander"
brew "nmap"
brew "pipx"
brew "podman"
brew "podman-compose"
brew "podman-tui"
brew "stern"
brew "talosctl"
brew "watch"
brew "yq"
brew "fluxcd/tap/flux"
brew "krunkit"
cask "arduino-ide"
cask "balenaetcher"
cask "bambu-studio"
cask "discord"
cask "freelens"
cask "ghostty"
cask "google-chrome"
cask "kitty"
cask "podman-desktop"
cask "raspberry-pi-imager"
cask "tailscale-app"
cask "telegram-desktop"
cask "visual-studio-code"
cask "wireshark-app"
cask "zed"
cask "zenmap"
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "azaugg.vscode-cfengine"
vscode "bbenoist.nix"
vscode "bbenoist.vagrant"
vscode "bierner.markdown-mermaid"
vscode "davidanson.vscode-markdownlint"
vscode "devmike.mikrotik-routeros-script"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "espressif.esp-idf-extension"
vscode "ex3ndr.llama-coder"
vscode "fnando.linter"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ibm.output-colorizer"
vscode "jakebathman.mysql-syntax"
vscode "jamiewoodio.cisco"
vscode "jinliming2.vscode-go-template"
vscode "kamikillerto.vscode-colorize"
vscode "keesschollaart.vscode-home-assistant"
vscode "korekontrol.saltstack"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marcostazi.vs-code-vagrantfile"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tatsy.vscode-3d-preview"
vscode "timonwong.shellcheck"
vscode "tinygo.vscode-tinygo"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "weaveworks.vscode-gitops-tools"
vscode "zainchen.json"
