##############################################################
# ~/.Brewfile - macOS Package Management                    #
# Usage: brew bundle --global                                #
# Cleanup: brew bundle cleanup --global                      #
# Repo: https://github.com/fmurodov/dotfiles                 #
##############################################################

# Options
cask_args appdir: '/Applications'

# Taps
tap 'siderolabs/tap'

# Mac App Store CLI
brew 'mas'

#############################################################
# Command Line Tools                                        #
#############################################################

# Shell & Terminal
brew 'fish'         # Modern shell
brew 'tmux'         # Terminal multiplexer

# Core Utils
brew 'bat'          # Better cat with syntax highlighting
brew 'fzf'          # Fuzzy finder
brew 'jq'           # JSON processor
brew 'mc'           # Visual file manager
brew 'rsync'        # File transfer
brew 'tree'         # Directory visualization
brew 'watch'        # Periodic command execution
brew 'yq'           # YAML processor

# Monitoring
brew 'bmon'         # Bandwidth monitor
brew 'gping'        # Interactive ping
brew 'speedtest-cli' # Network speed test
#brew 'ctop'        # Container metrics
#brew 'goaccess'    # Web log analyzer

# Productivity
brew 'asciinema'    # Terminal recording
brew 'fastfetch'    # System info
brew 'rclone'       # Cloud storage sync
#brew 'exiftool'    # EXIF metadata editor
#brew 'figlet'      # ASCII art text
#brew 'lolcat'      # Rainbow output
#brew 'neofetch'    # System info (alternative)
#brew 'pipes-sh'    # Screensaver
#brew 'pv'          # Pipe viewer

#############################################################
# Development                                               #
#############################################################

# Version Control & Git
brew 'git'
brew 'gh'           # GitHub CLI
brew 'lazygit'      # Git TUI
#brew 'git-extras'  # Git utilities

# Languages
brew 'go'
brew 'python'
#brew 'gcc'         # C/C++ compiler

# Containers & Orchestration
brew 'docker'
brew 'docker-compose'
brew 'kubernetes-cli'
brew 'lazydocker'   # Docker TUI
brew 'podman'
brew 'podman-compose'
brew 'talosctl'     # Talos Kubernetes CLI
cask 'podman-desktop'
#brew 'kdash'       # Kubernetes TUI

# DevOps
brew 'ansible'
brew 'cloudflared'  # Cloudflare Tunnel

# API & HTTP
brew 'curlie'       # HTTP client
cask 'bruno'        # API testing

# Editors & IDEs
cask 'ghostty'      # Terminal emulator
cask 'visual-studio-code'
cask 'zed'
#brew 'neovim'

# Database
cask 'tableplus'    # Database GUI

# Kubernetes
cask 'freelens'     # Kubernetes IDE

# Network & Security
brew 'nmap'         # Port scanner
cask 'wireshark-app'# Network analyzer
#brew 'bettercap'   # Network scanner

# Security & Encryption
#brew 'bcrypt'      # Encryption
#brew 'git-crypt'   # Git encryption
#brew 'openssl'     # SSL/TLS toolkit
#cask 'gpg-suite'   # PGP encryption

#############################################################
# Desktop Applications                                      #
#############################################################

# Productivity
cask '1password'    # Password manager
cask 'raycast', args: { require_sha: false } # Launcher

# Communication
cask 'slack'
cask 'telegram'
cask 'whatsapp'
cask 'zoom'
#cask 'signal'      # Encrypted messenger

# Browsers
cask 'chromium'
cask 'comet'        # AI-powered browser
cask 'firefox'
cask 'google-chrome'

# Networking
cask 'tailscale-app'  # VPN mesh network
#cask 'mountain-duck' # Cloud storage mounter

# Utilities
cask 'keka'         # Archive manager

# Creative
#cask 'audacity'    # Audio editor
#cask 'gimp'        # Image editor
#cask 'inkscape'    # Vector graphics
#cask 'obs'         # Screen recording
#brew 'handbrake'   # Video transcoder
#cask 'shotcut'     # Video editor

#############################################################
# macOS Enhancements                                        #
#############################################################

# System Tools
brew 'iproute2mac'  # Linux-style networking commands

# Window Management
#brew 'yabai'       # Tiling window manager
#brew 'skhd'        # Hotkey daemon

# Menubar
#cask 'anybar'      # Programmable menubar icons
#cask 'hiddenbar'   # Hide menubar icons
#cask 'stats'       # System monitor

# Utilities
#cask 'espanso'     # Text expander
#brew 'lporg'       # Launchpad backup
#brew 'm-cli'       # macOS management CLI
#cask 'openinterminal' # Terminal from Finder
#cask 'santa'       # Binary authorization
#cask 'shottr'      # Screenshot tool
#cask 'coteditor'   # Text editor
#cask 'little-snitch' # Firewall

# Quick Look Plugins
#cask 'qlcolorcode'    # Code with syntax
#cask 'qlimagesize'    # Image dimensions
#cask 'qlmarkdown'     # Markdown files
#cask 'qlprettypatch'  # Patches/diffs
#cask 'qlstephen'      # Plain text files
#cask 'qlvideo'        # Video previews
#cask 'quicklook-csv'  # CSV files
#cask 'quicklook-json', args: { require_sha: false } # JSON
#cask 'quicklookapk', args: { require_sha: false }   # APK files
#cask 'webpquicklook', args: { require_sha: false }  # WebP images

# Fonts
#tap 'homebrew/cask-fonts'
#cask 'font-fira-code'
#cask 'font-hack'
#cask 'font-inconsolata'
#cask 'font-meslo-lg-nerd-font'

# EOF
